app/Models/UserModel.php

SELECT `users`.*, `departments`.`name` AS `department_name`, `departments`.`code` AS `department_code`
FROM `users`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
WHERE `users`.`username` = 'admin'
AND `users`.`is_active` = 1
 LIMIT 1
---
    public function verify_user($username, $password)
    {
        $user = $this->select('users.*, departments.name AS department_name, departments.code AS department_code')
                     ->join('departments', 'departments.id = users.department_id', 'left')
                     ->where('users.username', $username)
                     ->where('users.is_active', 1)
                     ->first();

SELECT `users`.`id`, `users`.`username`, `users`.`full_name`, `users`.`role`, `users`.`is_active`, `users`.`created_at`, `users`.`department_id`, `departments`.`name` AS `department_name`, `departments`.`code` AS `department_code`
FROM `users`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
ORDER BY `users`.`full_name` ASC
---
    public function get_users()
    {
        return $this->select('users.id, users.username, users.full_name, users.role, users.is_active, users.created_at, users.department_id, departments.name AS department_name, departments.code AS department_code')
                    ->join('departments', 'departments.id = users.department_id', 'left')
                    ->orderBy('users.full_name', 'ASC')
                    ->findAll();